In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
import matplotlib.pyplot as plt

In [6]:
s = pd.Series([1,3,5,np.nan,6,8])

In [7]:
s

0     1
1     3
2     5
3   NaN
4     6
5     8
dtype: float64

In [8]:
dates = pd.date_range('20130101', periods=6)

In [9]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [10]:
print dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [11]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))

In [12]:
df

                   A         B         C         D
2013-01-01  0.006812 -0.916812 -0.262665 -0.763265
2013-01-02  1.792302  0.697133 -0.511457  0.885328
2013-01-03 -0.643570 -1.690342 -0.124117 -0.134972
2013-01-04 -0.494570 -1.358655 -1.745104  2.257314
2013-01-05 -0.714596  0.598386  0.939219 -0.909439
2013-01-06 -2.319230  0.684334 -0.224011 -1.502871

In [13]:
df2 = pd.DataFrame({ 'A' : 1.,
                   'B' : pd.Timestamp('20130102'),
                       'C' : pd.Series(1,index=list(range(4)),dtype='float32'),
                    'D' : np.array([3] * 4,dtype='int32'),
                   'E' : pd.Categorical(["test","train","test","train"]),
                    'F' : 'foo' })

In [14]:
df2

   A          B  C  D      E    F
0  1 2013-01-02  1  3   test  foo
1  1 2013-01-02  1  3  train  foo
2  1 2013-01-02  1  3   test  foo
3  1 2013-01-02  1  3  train  foo

In [15]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [16]:
df.head()

                   A         B         C         D
2013-01-01  0.006812 -0.916812 -0.262665 -0.763265
2013-01-02  1.792302  0.697133 -0.511457  0.885328
2013-01-03 -0.643570 -1.690342 -0.124117 -0.134972
2013-01-04 -0.494570 -1.358655 -1.745104  2.257314
2013-01-05 -0.714596  0.598386  0.939219 -0.909439

In [17]:
df.tail(3)

                   A         B         C         D
2013-01-04 -0.494570 -1.358655 -1.745104  2.257314
2013-01-05 -0.714596  0.598386  0.939219 -0.909439
2013-01-06 -2.319230  0.684334 -0.224011 -1.502871

In [18]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [19]:
df.values

array([[ 0.00681197, -0.91681168, -0.26266497, -0.7632649 ],
       [ 1.79230211,  0.69713282, -0.51145661,  0.88532777],
       [-0.64357048, -1.69034233, -0.12411729, -0.13497234],
       [-0.49456954, -1.35865507, -1.74510443,  2.25731433],
       [-0.7145959 ,  0.59838568,  0.9392186 , -0.90943882],
       [-2.31922984,  0.68433352, -0.22401105, -1.50287118]])

In [20]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.395475 -0.330993 -0.321356 -0.027984
std    1.328326  1.113443  0.860706  1.382828
min   -2.319230 -1.690342 -1.745104 -1.502871
25%   -0.696840 -1.248194 -0.449259 -0.872895
50%   -0.569070 -0.159213 -0.243338 -0.449119
75%   -0.118533  0.662847 -0.149091  0.630253
max    1.792302  0.697133  0.939219  2.257314

In [21]:
df.sort_index(axis=2, ascending=False)

ValueError: No axis named 2 for object type <class 'pandas.core.frame.DataFrame'>

In [22]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01 -0.763265 -0.262665 -0.916812  0.006812
2013-01-02  0.885328 -0.511457  0.697133  1.792302
2013-01-03 -0.134972 -0.124117 -1.690342 -0.643570
2013-01-04  2.257314 -1.745104 -1.358655 -0.494570
2013-01-05 -0.909439  0.939219  0.598386 -0.714596
2013-01-06 -1.502871 -0.224011  0.684334 -2.319230

In [23]:
df.sort_values(by='C')

                   A         B         C         D
2013-01-04 -0.494570 -1.358655 -1.745104  2.257314
2013-01-02  1.792302  0.697133 -0.511457  0.885328
2013-01-01  0.006812 -0.916812 -0.262665 -0.763265
2013-01-06 -2.319230  0.684334 -0.224011 -1.502871
2013-01-03 -0.643570 -1.690342 -0.124117 -0.134972
2013-01-05 -0.714596  0.598386  0.939219 -0.909439

In [24]:
df.A

2013-01-01    0.006812
2013-01-02    1.792302
2013-01-03   -0.643570
2013-01-04   -0.494570
2013-01-05   -0.714596
2013-01-06   -2.319230
Freq: D, Name: A, dtype: float64

In [25]:
df['A']

2013-01-01    0.006812
2013-01-02    1.792302
2013-01-03   -0.643570
2013-01-04   -0.494570
2013-01-05   -0.714596
2013-01-06   -2.319230
Freq: D, Name: A, dtype: float64

In [26]:
df[0:3]

                   A         B         C         D
2013-01-01  0.006812 -0.916812 -0.262665 -0.763265
2013-01-02  1.792302  0.697133 -0.511457  0.885328
2013-01-03 -0.643570 -1.690342 -0.124117 -0.134972

In [27]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02  1.792302  0.697133 -0.511457  0.885328
2013-01-03 -0.643570 -1.690342 -0.124117 -0.134972
2013-01-04 -0.494570 -1.358655 -1.745104  2.257314

In [28]:
df

                   A         B         C         D
2013-01-01  0.006812 -0.916812 -0.262665 -0.763265
2013-01-02  1.792302  0.697133 -0.511457  0.885328
2013-01-03 -0.643570 -1.690342 -0.124117 -0.134972
2013-01-04 -0.494570 -1.358655 -1.745104  2.257314
2013-01-05 -0.714596  0.598386  0.939219 -0.909439
2013-01-06 -2.319230  0.684334 -0.224011 -1.502871

In [29]:
df.loc[dates[0]]

A    0.006812
B   -0.916812
C   -0.262665
D   -0.763265
Name: 2013-01-01 00:00:00, dtype: float64

In [30]:
df.loc[:,['A','B']]

                   A         B
2013-01-01  0.006812 -0.916812
2013-01-02  1.792302  0.697133
2013-01-03 -0.643570 -1.690342
2013-01-04 -0.494570 -1.358655
2013-01-05 -0.714596  0.598386
2013-01-06 -2.319230  0.684334

In [31]:
df.loc['20130102':'20130104',['A','B']]

                   A         B
2013-01-02  1.792302  0.697133
2013-01-03 -0.643570 -1.690342
2013-01-04 -0.494570 -1.358655

In [32]:
df

                   A         B         C         D
2013-01-01  0.006812 -0.916812 -0.262665 -0.763265
2013-01-02  1.792302  0.697133 -0.511457  0.885328
2013-01-03 -0.643570 -1.690342 -0.124117 -0.134972
2013-01-04 -0.494570 -1.358655 -1.745104  2.257314
2013-01-05 -0.714596  0.598386  0.939219 -0.909439
2013-01-06 -2.319230  0.684334 -0.224011 -1.502871

In [33]:
df.iloc[3]

A   -0.494570
B   -1.358655
C   -1.745104
D    2.257314
Name: 2013-01-04 00:00:00, dtype: float64

In [34]:
df.iloc[3:5,0:2]

                   A         B
2013-01-04 -0.494570 -1.358655
2013-01-05 -0.714596  0.598386

In [35]:
df

                   A         B         C         D
2013-01-01  0.006812 -0.916812 -0.262665 -0.763265
2013-01-02  1.792302  0.697133 -0.511457  0.885328
2013-01-03 -0.643570 -1.690342 -0.124117 -0.134972
2013-01-04 -0.494570 -1.358655 -1.745104  2.257314
2013-01-05 -0.714596  0.598386  0.939219 -0.909439
2013-01-06 -2.319230  0.684334 -0.224011 -1.502871

In [36]:
df[df.A > 0]

                   A         B         C         D
2013-01-01  0.006812 -0.916812 -0.262665 -0.763265
2013-01-02  1.792302  0.697133 -0.511457  0.885328

In [37]:
df[df.B<0]

                   A         B         C         D
2013-01-01  0.006812 -0.916812 -0.262665 -0.763265
2013-01-03 -0.643570 -1.690342 -0.124117 -0.134972
2013-01-04 -0.494570 -1.358655 -1.745104  2.257314

In [38]:
df2 = df.copy()

In [39]:
df2

                   A         B         C         D
2013-01-01  0.006812 -0.916812 -0.262665 -0.763265
2013-01-02  1.792302  0.697133 -0.511457  0.885328
2013-01-03 -0.643570 -1.690342 -0.124117 -0.134972
2013-01-04 -0.494570 -1.358655 -1.745104  2.257314
2013-01-05 -0.714596  0.598386  0.939219 -0.909439
2013-01-06 -2.319230  0.684334 -0.224011 -1.502871

In [40]:
df2['E'] = ['one', 'one','two','three','four','three']

In [41]:
df2

                   A         B         C         D      E
2013-01-01  0.006812 -0.916812 -0.262665 -0.763265    one
2013-01-02  1.792302  0.697133 -0.511457  0.885328    one
2013-01-03 -0.643570 -1.690342 -0.124117 -0.134972    two
2013-01-04 -0.494570 -1.358655 -1.745104  2.257314  three
2013-01-05 -0.714596  0.598386  0.939219 -0.909439   four
2013-01-06 -2.319230  0.684334 -0.224011 -1.502871  three

In [42]:
df2[df2['E'].isin(['two','four'])]

                   A         B         C         D     E
2013-01-03 -0.643570 -1.690342 -0.124117 -0.134972   two
2013-01-05 -0.714596  0.598386  0.939219 -0.909439  four

In [43]:
s1 = pd.Series([1,2,3,4,5,6], index=pd.date_range('20130102', periods=6))

In [44]:
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [45]:
df['F'] = s1

In [46]:
df

                   A         B         C         D   F
2013-01-01  0.006812 -0.916812 -0.262665 -0.763265 NaN
2013-01-02  1.792302  0.697133 -0.511457  0.885328   1
2013-01-03 -0.643570 -1.690342 -0.124117 -0.134972   2
2013-01-04 -0.494570 -1.358655 -1.745104  2.257314   3
2013-01-05 -0.714596  0.598386  0.939219 -0.909439   4
2013-01-06 -2.319230  0.684334 -0.224011 -1.502871   5

In [47]:
df.at[dates[0],'A'] = 0

In [48]:
df

                   A         B         C         D   F
2013-01-01  0.000000 -0.916812 -0.262665 -0.763265 NaN
2013-01-02  1.792302  0.697133 -0.511457  0.885328   1
2013-01-03 -0.643570 -1.690342 -0.124117 -0.134972   2
2013-01-04 -0.494570 -1.358655 -1.745104  2.257314   3
2013-01-05 -0.714596  0.598386  0.939219 -0.909439   4
2013-01-06 -2.319230  0.684334 -0.224011 -1.502871   5

In [49]:
df.iat[0,1] = 0

In [50]:
df

                   A         B         C         D   F
2013-01-01  0.000000  0.000000 -0.262665 -0.763265 NaN
2013-01-02  1.792302  0.697133 -0.511457  0.885328   1
2013-01-03 -0.643570 -1.690342 -0.124117 -0.134972   2
2013-01-04 -0.494570 -1.358655 -1.745104  2.257314   3
2013-01-05 -0.714596  0.598386  0.939219 -0.909439   4
2013-01-06 -2.319230  0.684334 -0.224011 -1.502871   5

In [51]:
df.loc[:,'D'] = np.array([5] * len(df))

In [52]:
df

                   A         B         C  D   F
2013-01-01  0.000000  0.000000 -0.262665  5 NaN
2013-01-02  1.792302  0.697133 -0.511457  5   1
2013-01-03 -0.643570 -1.690342 -0.124117  5   2
2013-01-04 -0.494570 -1.358655 -1.745104  5   3
2013-01-05 -0.714596  0.598386  0.939219  5   4
2013-01-06 -2.319230  0.684334 -0.224011  5   5

In [53]:
df2 = df.copy()

In [54]:
df2

                   A         B         C  D   F
2013-01-01  0.000000  0.000000 -0.262665  5 NaN
2013-01-02  1.792302  0.697133 -0.511457  5   1
2013-01-03 -0.643570 -1.690342 -0.124117  5   2
2013-01-04 -0.494570 -1.358655 -1.745104  5   3
2013-01-05 -0.714596  0.598386  0.939219  5   4
2013-01-06 -2.319230  0.684334 -0.224011  5   5

In [55]:
df2[df2 > 0] = -df2

In [56]:
df2

                   A         B         C  D   F
2013-01-01  0.000000  0.000000 -0.262665 -5 NaN
2013-01-02 -1.792302 -0.697133 -0.511457 -5  -1
2013-01-03 -0.643570 -1.690342 -0.124117 -5  -2
2013-01-04 -0.494570 -1.358655 -1.745104 -5  -3
2013-01-05 -0.714596 -0.598386 -0.939219 -5  -4
2013-01-06 -2.319230 -0.684334 -0.224011 -5  -5

In [57]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])

In [58]:
df1

                   A         B         C  D   F   E
2013-01-01  0.000000  0.000000 -0.262665  5 NaN NaN
2013-01-02  1.792302  0.697133 -0.511457  5   1 NaN
2013-01-03 -0.643570 -1.690342 -0.124117  5   2 NaN
2013-01-04 -0.494570 -1.358655 -1.745104  5   3 NaN

In [59]:
df1.dropna(how='any')

Empty DataFrame
Columns: [A, B, C, D, F, E]
Index: []

In [60]:
df1.dropna(how='any')

Empty DataFrame
Columns: [A, B, C, D, F, E]
Index: []

In [61]:
df1

                   A         B         C  D   F   E
2013-01-01  0.000000  0.000000 -0.262665  5 NaN NaN
2013-01-02  1.792302  0.697133 -0.511457  5   1 NaN
2013-01-03 -0.643570 -1.690342 -0.124117  5   2 NaN
2013-01-04 -0.494570 -1.358655 -1.745104  5   3 NaN

In [62]:
df1.dropna(how='any')

Empty DataFrame
Columns: [A, B, C, D, F, E]
Index: []

In [63]:
df1

                   A         B         C  D   F   E
2013-01-01  0.000000  0.000000 -0.262665  5 NaN NaN
2013-01-02  1.792302  0.697133 -0.511457  5   1 NaN
2013-01-03 -0.643570 -1.690342 -0.124117  5   2 NaN
2013-01-04 -0.494570 -1.358655 -1.745104  5   3 NaN

In [64]:
df1.fillna(value=5)

                   A         B         C  D  F  E
2013-01-01  0.000000  0.000000 -0.262665  5  5  5
2013-01-02  1.792302  0.697133 -0.511457  5  1  5
2013-01-03 -0.643570 -1.690342 -0.124117  5  2  5
2013-01-04 -0.494570 -1.358655 -1.745104  5  3  5

In [65]:
pd.isnull(df1)

                A      B      C      D      F     E
2013-01-01  False  False  False  False   True  True
2013-01-02  False  False  False  False  False  True
2013-01-03  False  False  False  False  False  True
2013-01-04  False  False  False  False  False  True

In [66]:
df

                   A         B         C  D   F
2013-01-01  0.000000  0.000000 -0.262665  5 NaN
2013-01-02  1.792302  0.697133 -0.511457  5   1
2013-01-03 -0.643570 -1.690342 -0.124117  5   2
2013-01-04 -0.494570 -1.358655 -1.745104  5   3
2013-01-05 -0.714596  0.598386  0.939219  5   4
2013-01-06 -2.319230  0.684334 -0.224011  5   5

In [67]:
df.mean()

A   -0.396611
B   -0.178191
C   -0.321356
D    5.000000
F    3.000000
dtype: float64

In [68]:
df.mean(1)

2013-01-01    1.184334
2013-01-02    1.595596
2013-01-03    0.908394
2013-01-04    0.880334
2013-01-05    1.964602
2013-01-06    1.628219
Freq: D, dtype: float64

In [69]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [70]:
 s = pd.Series([1,3,5,np.nan,6,8], index=dates).shift(2)

In [71]:
s

2013-01-01   NaN
2013-01-02   NaN
2013-01-03     1
2013-01-04     3
2013-01-05     5
2013-01-06   NaN
Freq: D, dtype: float64

In [72]:
df

                   A         B         C  D   F
2013-01-01  0.000000  0.000000 -0.262665  5 NaN
2013-01-02  1.792302  0.697133 -0.511457  5   1
2013-01-03 -0.643570 -1.690342 -0.124117  5   2
2013-01-04 -0.494570 -1.358655 -1.745104  5   3
2013-01-05 -0.714596  0.598386  0.939219  5   4
2013-01-06 -2.319230  0.684334 -0.224011  5   5

In [73]:
df.sub(s, axis='index')

                   A         B         C   D   F
2013-01-01       NaN       NaN       NaN NaN NaN
2013-01-02       NaN       NaN       NaN NaN NaN
2013-01-03 -1.643570 -2.690342 -1.124117   4   1
2013-01-04 -3.494570 -4.358655 -4.745104   2   0
2013-01-05 -5.714596 -4.401614 -4.060781   0  -1
2013-01-06       NaN       NaN       NaN NaN NaN

In [74]:
s

2013-01-01   NaN
2013-01-02   NaN
2013-01-03     1
2013-01-04     3
2013-01-05     5
2013-01-06   NaN
Freq: D, dtype: float64

In [75]:
df.apply(np.cumsum)

                   A         B         C   D   F
2013-01-01  0.000000  0.000000 -0.262665   5 NaN
2013-01-02  1.792302  0.697133 -0.774122  10   1
2013-01-03  1.148732 -0.993210 -0.898239  15   3
2013-01-04  0.654162 -2.351865 -2.643343  20   6
2013-01-05 -0.060434 -1.753479 -1.704125  25  10
2013-01-06 -2.379664 -1.069145 -1.928136  30  15

In [76]:
df

                   A         B         C  D   F
2013-01-01  0.000000  0.000000 -0.262665  5 NaN
2013-01-02  1.792302  0.697133 -0.511457  5   1
2013-01-03 -0.643570 -1.690342 -0.124117  5   2
2013-01-04 -0.494570 -1.358655 -1.745104  5   3
2013-01-05 -0.714596  0.598386  0.939219  5   4
2013-01-06 -2.319230  0.684334 -0.224011  5   5

In [77]:
df.apply(np.cumsum)

                   A         B         C   D   F
2013-01-01  0.000000  0.000000 -0.262665   5 NaN
2013-01-02  1.792302  0.697133 -0.774122  10   1
2013-01-03  1.148732 -0.993210 -0.898239  15   3
2013-01-04  0.654162 -2.351865 -2.643343  20   6
2013-01-05 -0.060434 -1.753479 -1.704125  25  10
2013-01-06 -2.379664 -1.069145 -1.928136  30  15

In [78]:
s = pd.Series(np.random.randint(0, 7, size=10))

In [79]:
s

0    1
1    4
2    1
3    2
4    3
5    1
6    6
7    1
8    4
9    4
dtype: int32

In [80]:
s.value_counts()

1    4
4    3
6    1
3    1
2    1
dtype: int64

In [81]:
s = pd.Series(['A', 'B', 'C', 'Aaba', 'Baca', np.nan, 'CABA', 'dog', 'cat'])